USE test;

DROP TABLE IF EXISTS part;
CREATE TABLE part(
id INT(11) NOT NULL AUTO_INCREMENT,
`type` VARCHAR(255),
is_necessary BIT(1),
quantity INT(11),
PRIMARY KEY (id))
ENGINE = InnoDB
DEFAULT CHARACTER SET = utf8;
INSERT INTO part (id, `type`, is_necessary,quantity)
	VALUES
		(1,'Материнская плата',1,113),
		(2,'Дисковод CD RW',0,2),
		(3,'Звуковая карта',0,7),
		(4,'Процессор',1,56),
		(5,'Wi-Fi адаптер',0,2),
		(6,'Веб-камера',0,4),
		(7,'Сетевой адаптер',0,6),
		(8,'Корпус',1,97),
		(9,'Оперативная память',1,76),
		(10,'Жесткий диск HDD',1,122),
		(11,'Диск SSD',0,1),
		(12,'Клавиатура',0,3),
		(13,'Модем',0,7),
		(14,'Подсветка корпуса',0,11),
		(15,'Блок питания',1,98),
		(16,'Дисковод 3.5',0,1),
		(17,'Адаптер SD',0,12),
		(18,'Дисковод DVD RW',0,7),
		(19,'Видеокарта',1,201),
		(20,'Кулер для винчестера',0,3),
		(21,'Blue-ray привод',0,1),
		(22,'Кулер процессора',1,162),
		(23,'Внешний жесткий диск',0,17),
		(24,'ИБП',0,3),
		(25,'Адаптер USB 3.1',0,2);